In [1]:
dict={'First Name':['aanya','fatima','rohan','aditi'],
      'Last Name': ['tripathi','kashtvari','bali','tripathi'],
     'email':['aanya@gmail.com','f@gmail.com','bali@gmail.com','as@gmail.com']}

In [2]:
dict['First Name']

['aanya', 'fatima', 'rohan', 'aditi']

In [3]:
dict['Last Name']

['tripathi', 'kashtvari', 'bali', 'tripathi']

In [4]:
import pandas as pd

In [5]:
df= pd.DataFrame(dict)

In [6]:
df

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [7]:
df['First Name']

0     aanya
1    fatima
2     rohan
3     aditi
Name: First Name, dtype: object

In [8]:
df[['First Name','Last Name']]

  First Name  Last Name
0      aanya   tripathi
1     fatima  kashtvari
2      rohan       bali
3      aditi   tripathi

In [9]:
type(df['First Name'])

pandas.core.series.Series

In [10]:
df.email

0    aanya@gmail.com
1        f@gmail.com
2     bali@gmail.com
3       as@gmail.com
Name: email, dtype: object

In [11]:
df[['First Name','Last Name','email']]

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [12]:
df.columns

Index(['First Name', 'Last Name', 'email'], dtype='object')

In [13]:
df.iloc[0]
# loc and iloc to access rows in dictionary
# iloc is used to search using the integer location

First Name              aanya
Last Name            tripathi
email         aanya@gmail.com
Name: 0, dtype: object

In [14]:
df.iloc[0,1]

'tripathi'

In [15]:
df.iloc[[0,1]]

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com

In [16]:
df.iloc[[0,1],1]
# iloc is used to find and search of the columns as well, 
#the first column has location 0 and thus the last column email has loc 2.

0     tripathi
1    kashtvari
Name: Last Name, dtype: object

In [17]:
df

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [18]:
df.loc[0]
# loc is used to

First Name              aanya
Last Name            tripathi
email         aanya@gmail.com
Name: 0, dtype: object

In [19]:
df.loc[[0,2],['email','Last Name']]
# loc can be used to determine the rows and columns as well, Remember to keep in a list

             email Last Name
0  aanya@gmail.com  tripathi
2   bali@gmail.com      bali

In [20]:
df

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [21]:
df.set_index('email')

                First Name  Last Name
email
aanya@gmail.com      aanya   tripathi
f@gmail.com         fatima  kashtvari
bali@gmail.com       rohan       bali
as@gmail.com         aditi   tripathi

In [22]:
df

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [23]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [24]:
df.set_index('First Name', inplace=True)

In [25]:
df

            Last Name            email
First Name
aanya        tripathi  aanya@gmail.com
fatima      kashtvari      f@gmail.com
rohan            bali   bali@gmail.com
aditi        tripathi     as@gmail.com

In [26]:
df.reset_index(inplace=True)

In [27]:
df

  First Name  Last Name            email
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [28]:
filt=(df ['Last Name'] == 'tripathi') & (df['First Name']=='aanya')

In [29]:
df.loc[filt]

  First Name Last Name            email
0      aanya  tripathi  aanya@gmail.com

In [30]:
filt1= (df['First Name']== 'aditi') | (df['Last Name']=='bali')

In [31]:
df.loc[filt1]

  First Name Last Name           email
2      rohan      bali  bali@gmail.com
3      aditi  tripathi    as@gmail.com

In [32]:
df.loc[filt1,'email']

2    bali@gmail.com
3      as@gmail.com
Name: email, dtype: object

In [33]:
df.columns

Index(['First Name', 'Last Name', 'email'], dtype='object')

In [34]:
df.columns=['first','last','email id']

In [35]:
df

    first       last         email id
0   aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   rohan       bali   bali@gmail.com
3   aditi   tripathi     as@gmail.com

In [36]:
df.columns=[x.upper()for x in df.columns]

In [37]:
df

    FIRST       LAST         EMAIL ID
0   aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   rohan       bali   bali@gmail.com
3   aditi   tripathi     as@gmail.com

In [38]:
df.columns=df.columns.str.replace(' ','_')

In [39]:
df

    FIRST       LAST         EMAIL_ID
0   aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   rohan       bali   bali@gmail.com
3   aditi   tripathi     as@gmail.com

In [40]:
df.columns=[x.lower() for x in df.columns]

In [41]:
df

    first       last         email_id
0   aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   rohan       bali   bali@gmail.com
3   aditi   tripathi     as@gmail.com

In [42]:
df.rename(columns={'first':'First_Name',
'last':'Last_Name', 'email_id':'Email_ID'}, inplace=True)

In [43]:
df

  First_Name  Last_Name         Email_ID
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      rohan       bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [44]:
df.at[2]=['Rohan','Bali','bali@gmail.com']

In [45]:
df

  First_Name  Last_Name         Email_ID
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      aditi   tripathi     as@gmail.com

In [46]:
df.loc[3,['Email_ID']]=['adii@gail.con']

In [47]:
df

  First_Name  Last_Name         Email_ID
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      aditi   tripathi    adii@gail.con

In [48]:
df.loc[3,"Last_Name" ] = "Tripathi"

In [49]:
df

  First_Name  Last_Name         Email_ID
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      aditi   Tripathi    adii@gail.con

In [50]:
df.at[3,'First_Name']="Aditi"

In [51]:
df

  First_Name  Last_Name         Email_ID
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      Aditi   Tripathi    adii@gail.con

In [52]:
didii= (df["Email_ID"] == 'adii@gail.con')
df.loc[didii, "Last_Name"]='Didi'

In [53]:
df

  First_Name  Last_Name         Email_ID
0      aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      Aditi       Didi    adii@gail.con

In [54]:
f=df["First_Name"]=='aanya'
df.loc[f,'First_Name']='Aanya'

In [55]:
df

  First_Name  Last_Name         Email_ID
0      Aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      Aditi       Didi    adii@gail.con

In [56]:
df['Email_ID']=df['Email_ID'].str.upper()

In [57]:
df

  First_Name  Last_Name         Email_ID
0      Aanya   tripathi  AANYA@GMAIL.COM
1     fatima  kashtvari      F@GMAIL.COM
2      Rohan       Bali   BALI@GMAIL.COM
3      Aditi       Didi    ADII@GAIL.CON

In [58]:
df['Email_ID']=df['Email_ID'].str.lower()

In [59]:
df

  First_Name  Last_Name         Email_ID
0      Aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      Aditi       Didi    adii@gail.con

In [60]:
aditi_email=df['Email_ID']=='adii@gail.con'

In [61]:
df.loc[aditi_email,'Email_ID']='aditi@gmail.com'

In [62]:
df

  First_Name  Last_Name         Email_ID
0      Aanya   tripathi  aanya@gmail.com
1     fatima  kashtvari      f@gmail.com
2      Rohan       Bali   bali@gmail.com
3      Aditi       Didi  aditi@gmail.com

In [63]:
df.columns=['first','last','email']

In [64]:
df

    first       last            email
0   Aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   Rohan       Bali   bali@gmail.com
3   Aditi       Didi  aditi@gmail.com

In [65]:
# apply can only be used with series
df['email'].apply(len)

0    15
1    11
2    14
3    15
Name: email, dtype: int64

In [66]:
df.apply(len)

first    4
last     4
email    4
dtype: int64

In [67]:
df.apply(len,axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [68]:
def update_email(email):
    return email.upper()

df['email']=df['email'].apply(update_email)

In [69]:
df

    first       last            email
0   Aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   Rohan       Bali   bali@gmail.com
3   Aditi       Didi  aditi@gmail.com

In [70]:
df['email']= df['email'].apply(update_email)
df

    first       last            email
0   Aanya   tripathi  AANYA@GMAIL.COM
1  fatima  kashtvari      F@GMAIL.COM
2   Rohan       Bali   BALI@GMAIL.COM
3   Aditi       Didi  ADITI@GMAIL.COM

In [71]:
df['email']=df['email'].apply(lambda x:x.lower())

In [72]:
df

    first       last            email
0   Aanya   tripathi  aanya@gmail.com
1  fatima  kashtvari      f@gmail.com
2   Rohan       Bali   bali@gmail.com
3   Aditi       Didi  aditi@gmail.com

In [73]:
df['last']=df['last'].map({'tripathi':'Tripathi','kashtvari':'Rs','Bali':'Singh','Didi':'Schoetz'})

In [74]:
df

    first      last            email
0   Aanya  Tripathi  aanya@gmail.com
1  fatima        Rs      f@gmail.com
2   Rohan     Singh   bali@gmail.com
3   Aditi   Schoetz  aditi@gmail.com

In [75]:
df['first']=df['first'].replace({'fatima':'Fatima'})

In [76]:
df

    first      last            email
0   Aanya  Tripathi  aanya@gmail.com
1  Fatima        Rs      f@gmail.com
2   Rohan     Singh   bali@gmail.com
3   Aditi   Schoetz  aditi@gmail.com

In [77]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [78]:
df['full']=df['first']+' '+df['last']

In [79]:
df['number']=df['email'].apply(lambda x:x.upper())

In [80]:
def join_name(first,last):
    return first+last

In [81]:
df.drop(columns=['first','last','number'],inplace=True)

In [82]:
df['Age']=18

In [83]:
df

             email            full  Age
0  aanya@gmail.com  Aanya Tripathi   18
1      f@gmail.com       Fatima Rs   18
2   bali@gmail.com     Rohan Singh   18
3  aditi@gmail.com   Aditi Schoetz   18

In [84]:
desired_order=['full','email','Age']

In [85]:
df=df[desired_order]

In [86]:
df

             full            email  Age
0  Aanya Tripathi  aanya@gmail.com   18
1       Fatima Rs      f@gmail.com   18
2     Rohan Singh   bali@gmail.com   18
3   Aditi Schoetz  aditi@gmail.com   18

In [87]:
df.loc[1]

full       Fatima Rs
email    f@gmail.com
Age               18
Name: 1, dtype: object

In [88]:
df.loc[1,'Age']=20

In [89]:
df

             full            email  Age
0  Aanya Tripathi  aanya@gmail.com   18
1       Fatima Rs      f@gmail.com   20
2     Rohan Singh   bali@gmail.com   18
3   Aditi Schoetz  aditi@gmail.com   18

df.loc[3,'Age']=32

In [90]:
df.loc[3,'Age']=13

In [91]:
df

             full            email  Age
0  Aanya Tripathi  aanya@gmail.com   18
1       Fatima Rs      f@gmail.com   20
2     Rohan Singh   bali@gmail.com   18
3   Aditi Schoetz  aditi@gmail.com   13

In [92]:
def check_age(age):
    if int(age)>=18:
        return'Yes'
    else:
        return'No'

In [93]:
df['Adult']= df['Age'].apply(check_age)

In [94]:
df

             full            email  Age Adult
0  Aanya Tripathi  aanya@gmail.com   18   Yes
1       Fatima Rs      f@gmail.com   20   Yes
2     Rohan Singh   bali@gmail.com   18   Yes
3   Aditi Schoetz  aditi@gmail.com   13    No

In [95]:
df['full'].str.split(' ')

0    [Aanya, Tripathi]
1         [Fatima, Rs]
2       [Rohan, Singh]
3     [Aditi, Schoetz]
Name: full, dtype: object

In [96]:
df['full'].str.split(' ',expand=True)

        0         1
0   Aanya  Tripathi
1  Fatima        Rs
2   Rohan     Singh
3   Aditi   Schoetz

In [97]:
df[['first','last']]=df['full'].str.split(' ',expand=True)

In [98]:
df

             full            email  Age Adult   first      last
0  Aanya Tripathi  aanya@gmail.com   18   Yes   Aanya  Tripathi
1       Fatima Rs      f@gmail.com   20   Yes  Fatima        Rs
2     Rohan Singh   bali@gmail.com   18   Yes   Rohan     Singh
3   Aditi Schoetz  aditi@gmail.com   13    No   Aditi   Schoetz

In [99]:
df.drop(columns=['full'])

             email  Age Adult   first      last
0  aanya@gmail.com   18   Yes   Aanya  Tripathi
1      f@gmail.com   20   Yes  Fatima        Rs
2   bali@gmail.com   18   Yes   Rohan     Singh
3  aditi@gmail.com   13    No   Aditi   Schoetz

In [100]:
desired_order=['first','last','Age','Adult','email']

In [101]:
df=df[desired_order]

In [102]:
df

    first      last  Age Adult            email
0   Aanya  Tripathi   18   Yes  aanya@gmail.com
1  Fatima        Rs   20   Yes      f@gmail.com
2   Rohan     Singh   18   Yes   bali@gmail.com
3   Aditi   Schoetz   13    No  aditi@gmail.com

In [103]:
df.append({'first':'Keya'}, ignore_index=True)

    first      last   Age Adult            email
0   Aanya  Tripathi  18.0   Yes  aanya@gmail.com
1  Fatima        Rs  20.0   Yes      f@gmail.com
2   Rohan     Singh  18.0   Yes   bali@gmail.com
3   Aditi   Schoetz  13.0    No  aditi@gmail.com
4    Keya       NaN   NaN   NaN              NaN

In [135]:
dict2={'first':['Lion','King','Shaun'],
     'last':['Roar','Khan','Mendes'], 
     'Age':[12,5,21],
     'email':['sds@g.com','kk@gmail.com','mendes@gmail.com']}

In [136]:
df2=pd.DataFrame(dict2)
df2

   first    last  Age             email
0   Lion    Roar   12         sds@g.com
1   King    Khan    5      kk@gmail.com
2  Shaun  Mendes   21  mendes@gmail.com

In [137]:
df2['Adult']=df2['Age'].apply(check_age)

In [138]:
df2

   first    last  Age             email Adult
0   Lion    Roar   12         sds@g.com    No
1   King    Khan    5      kk@gmail.com    No
2  Shaun  Mendes   21  mendes@gmail.com   Yes

In [139]:
df=df.append(df2, ignore_index=True)

In [140]:
df

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com
6    Lion      Roar  12    No         sds@g.com
7    King      Khan   5    No      kk@gmail.com
8   Shaun    Mendes  21   Yes  mendes@gmail.com

In [141]:
df.drop(index=6)

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com
7    King      Khan   5    No      kk@gmail.com
8   Shaun    Mendes  21   Yes  mendes@gmail.com

In [142]:
df

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com
6    Lion      Roar  12    No         sds@g.com
7    King      Khan   5    No      kk@gmail.com
8   Shaun    Mendes  21   Yes  mendes@gmail.com

In [143]:
df.drop(index=df[df['last']=='Khan'].index, inplace=True)

In [144]:
df

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com
6    Lion      Roar  12    No         sds@g.com
8   Shaun    Mendes  21   Yes  mendes@gmail.com

In [145]:
df.append({'first':'Aanya','last':'Schoetz','Age':20,'Adult':'Yes','email':'aanya@hotmail.com'}, ignore_index=True)

    first      last Age Adult              email
0   Aanya  Tripathi  18   Yes    aanya@gmail.com
1  Fatima        Rs  20   Yes        f@gmail.com
2   Rohan     Singh  18   Yes     bali@gmail.com
3   Aditi   Schoetz  13    No    aditi@gmail.com
4    Lion      Roar  12    No          sds@g.com
5   Shaun    Mendes  21   Yes   mendes@gmail.com
6    Lion      Roar  12    No          sds@g.com
7   Shaun    Mendes  21   Yes   mendes@gmail.com
8   Aanya   Schoetz  20   Yes  aanya@hotmail.com

In [146]:
df.sort_values(by='Age')

TypeError: '<' not supported between instances of 'str' and 'int'

In [149]:
dict3={'first':['graham','mike','colin'],'age':[45,20,54]}

In [150]:
df3=pd.DataFrame(dict3)

### creating new data frame

In [151]:
df3

    first  age
0  graham   45
1    mike   20
2   colin   54

In [152]:
df3.sort_values(by='age')

    first  age
1    mike   20
0  graham   45
2   colin   54

In [155]:
df.sort_values(by=['last','first'],ascending=[True,False])

    first      last Age Adult             email
5   Shaun    Mendes  21   Yes  mendes@gmail.com
8   Shaun    Mendes  21   Yes  mendes@gmail.com
4    Lion      Roar  12    No         sds@g.com
6    Lion      Roar  12    No         sds@g.com
1  Fatima        Rs  20   Yes       f@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
0   Aanya  Tripathi  18   Yes   aanya@gmail.com

In [159]:
df.drop(index=[8,6],inplace=True)

In [160]:
df

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com

In [169]:
df.sort_values(by=['first','last'],ascending=[True,False],inplace=True)

In [168]:
df.sort_index()

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com

In [171]:
df.sort_index()

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
2   Rohan     Singh  18   Yes    bali@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
4    Lion      Roar  12    No         sds@g.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com

In [172]:
df

    first      last Age Adult             email
0   Aanya  Tripathi  18   Yes   aanya@gmail.com
3   Aditi   Schoetz  13    No   aditi@gmail.com
1  Fatima        Rs  20   Yes       f@gmail.com
4    Lion      Roar  12    No         sds@g.com
2   Rohan     Singh  18   Yes    bali@gmail.com
5   Shaun    Mendes  21   Yes  mendes@gmail.com